{"pages":[],"posts":[{"title":"Introduction","text":"Merger it is a simple yet powerful HTML based application that can help people merge multiple qrcodes into one link. So that the payer can concentrate on only one qrcode, or one simple link. Read more about the background at Hello. Get to Know Merger. You can generate a QR Code for your merger (see an example) or send your merger link to someone else. Merger will detect the person’s client by User Agent, then present relavent contents. Since Release 0.20, merger had supported multilingual, usage definition and automatic page title &amp; icon for the first time. This means you could configure merger easier, and your users will gain better experience while using merger. Features Supports multilingual. Minimal number of requests, fastest loading speed. Detailed code comments , make ease for further developments. Integrate with actual usage scenes, to present a individually-designed style for each payment method. Highly customisable, everthing on the page can be changed through the preset Javascript codes. No need for any programming technique. All static contents are merged and served through the Open Source CDN jsDelivr. Live DemoSee: https://demo.qrcdn.comHost Environment: Ubuntu 18.04.2 LTS | nginx/1.16.0 | Accelerated By CloudFlare | Hosted By Vultr Or Use Phone Camera | QQ Mobile | WeChat | Alipay to Scan this QR Code Demo From Users https://pay.ryanc.cc Submit your merger site here for presentation ScreenshotThe screenshot below showed different styles whlist opening merger in different clients. Download Raw Image Community If you spotted any problems during using merger, please create an Issue. If you want to make merger even better, welcome to submit Pull Requests. Credit The documentation is written in both Chinese and English, created via Docsify Hexo, published on GitHub Pages, served from Netlify and distributed through CloudFlare under GNU General Public License v3.0. Images in this documentation is uploaded using upimg-cli. The origin materials in both icon and presentation banner are from zylbiubiubiu, Iconfont. Part of the Javascript codes in this project are contributed by @LF112. This project is based on Grouper (please refer to the credit list of Grouper) This project also used projects / services below: Spectre.css JQuery lrsjng/jquery-qrcode jsDelivr Pure CSS3 Gradient Background Animation Iconfont.cn Edit this documentation on GitHub.","link":"/docs/introduction.html"},{"title":"Deploy","text":"Merger is a simple HTML application, therefore you can deploy it to any services that can host static websites and browse it through a domain. Before this, please make sure you have done the personalised settings according to the Configure page. Here are some links that might be useful: Deploy to GitHub Pages https://help.github.com/en/articles/fork-a-repo https://help.github.com/en/articles/configuring-a-publishing-source-for-github-pages https://help.github.com/en/articles/using-a-custom-domain-with-github-pages https://help.github.com/en/articles/adding-or-removing-a-custom-domain-for-your-github-pages-site Deploy to Ubuntu Server https://www.digitalocean.com/community/tutorials/how-to-install-nginx-on-ubuntu-18-04-quickstart https://medium.com/@jgefroh/a-guide-to-using-nginx-for-static-websites-d96a9d034940 https://oneinstack.com https://nginx.org/en/docs/beginners_guide.html https://www.nginx.com/resources/wiki/start/topics/examples/full/ https://nginxconfig.io Deploy to Netlify https://www.netlify.com/blog/2016/09/29/a-step-by-step-guide-deploying-on-netlify/ https://www.netlify.com/docs/custom-domains/ Deploy to now.sh https://zeit.co/docs/v2/getting-started/introduction-to-now/ https://zeit.co/docs/v2/getting-started/installation/ https://zeit.co/docs/v2/deployments/basics/ https://zeit.co/docs/v2/domains-and-aliases/adding-a-domain Deploy to HeroKu https://devcenter.heroku.com/articles/git https://devcenter.heroku.com/articles/github-integration https://stackoverflow.com/questions/17558007/deploy-to-heroku-directly-from-my-github-repository https://devcenter.heroku.com/articles/custom-domains https://stackoverflow.com/questions/5480337/easy-way-to-prevent-heroku-idling","link":"/docs/deploy.html"},{"title":"Install","text":"We would only suggest you to use versions that are released, instead of copying the whole code repository that would maintain its development progress. Before using any releases, please make sure you have read relevent release notes. Before We Start?&gt; We would strongly advise you to subscribe our releases through the Release Only option to get further version updates. Subscribe on GitHub.com !&gt; Once a new version is released, the primary email you set in GitHub Settings will receive a notification email. Latest ReleaseStable Release: Pre-release: Get Stable Release: https://github.com/hifocus/merger/releases/latestGet Pre-release: https://github.com/hifocus/merger/releases/tag/0.20 You may use the links below to download relevent merger releases:Latest / Pre-release Using Command LineYou may also use the command below to download relevent merger release: 1wget https://github.com/hifocus/merger/archive/0.15.zip # latest After you downloaded merger, you should firstly finish the configuration to merger (see Configure), then use your preferred tool to upload the whole merger directory to your server to complete the deployment (see Deploy).","link":"/docs/install.html"},{"title":"Configure","text":"This piece of document is out-dated. Please wait for an update. The configuration of merger is simple. Generally, you would only need to modify the Config Part in merger.html to create your own merger page. Config Part：https://github.com/hifocus/merger/blob/master/merger.html#L38 The format of Config Part is: var something = &quot;something_actual&quot; Please do not ignore the spaces before and after the equal sign =, as well as the double quotes &quot; &quot; before and after the something_actual part. Configure Payment LinksIn Config Part, you will firstly see 4 lines of codes as below; you must modify them to your own. 1234var wechat = \"wxp://f2f0xFuBE5tqPeKuwZxWkpE0CBf4-GkfwdpN\";var alipay = \"https://qr.alipay.com/fkx01299q4zug8xxsp2vc0a?t=1545238142543\";var tenpay = \"https://i.qianbao.qq.com/wallet/sqrcode.htm?m=tenpay&amp;f=wallet&amp;a=1&amp;ac=26E3D12F23952F04A9553D36B31F18BC3AEA141B073F9DD9BC3747C823819645&amp;u=1031092401&amp;n=惶心\";var paypal = \"https://paypal.me/hxco\"; The table below explained the meanings of variables. Variables Repersents Official Sites Link Styles Method to Get the Link wechat WeChat Pay https://weixin.qq.com wxp://{personalised-content} Decode Payment QR Code alipay Alipay https://www.alipay.com https://qr.alipay.com/{personalised-content} Decode Payment QR Code tenpay QQ Walllet https://im.qq.com https://i.qianbao.qq.com/{personalised-content} Decode Payment QR Code paypal Paypal https://www.paypal.com https://paypal.me/{username} From Website For apps that require decode payment QR Code, please display your payment QR Code in the app, then use the internal save function or screenshot to get the QR Code, after that use QR Code decode program to get the payment link; you can get some QR Code decode programs from the search engine: https://www.google.com/search?q=qr+code+decoder For Paypal, you need to generate your personal payment link at https://paypal.me. If you don’t have a Paypal, please leave var paypal = &quot;xxx blank or comment it out.If you don’t have either wechat, alipay, or tenpay, please fill in any websites, such as https://github.com. Configure Nickname and Profile PhotoThe next section of Config Part needs you to fill in your nickname and profile photo url. This section is as below: 123// Replace with your id and profile photo link ↓.var myname = \"惶心\";var profile = \"https://ae01.alicdn.com/kf/UTB8R57Nn0nJXKJkSaiyq6AhwXXak.jpg\"; var myname = &quot;xxx&quot; needs you to fill in your preffered nickname.var profile = &quot;xxx&quot; needs you to fill in the url of your preffered profile photo. If you don’t know how to do it, the simplist way is upload your photo to Imgur, then fill in the url returned by Imgur. 1var profile = \"https://i.imgur.com/LgEduDF.jpg\"; In order to guarantee the highest possible availability, we do not recommend to self-host the profile photo unless you’ve got total confident. Now, you have fully configured each variable required. Configure Guiding Texts (Optional)The section after of Config Part is guiding texts. These words are used to guide the visitor to the next step. For example, click on the buttons, scan the QR Codes, and so on. The default guiding texts are as below, you can customise as you wish: 123// Replace the title and subtitle if preferred (not required) ↓.var title = \"Choose Your Payment Method\";var subtitle = \"Follow Further Instruction to Pay to\" + myname ; Debug Mode and APIThe last section of Config Part contains debug mode switch and the choose of QR Code API. The specific code is as follows： 123456// See if you would like to enable debug mode (as console.log). If debug mode is disabled, the console will be cleared.// To disable it, comment out (or just delete) the `var debugmode = \"xxx\" part` ↓.var debugmode = \"true\";// QQ Mobile wouldn't decode qrcode from `data:image`, so for qq mobile only speical qrcode that generate from qrcode api is required.var qrcodeapi = \"https://www.zhihu.com/qrcode?url=\";// var qrcodeapi = \"https://chart.googleapis.com/chart?chs=500x500&amp;cht=qr&amp;chld=L|1&amp;choe=UTF-8&amp;chl=\"; // Inaccessible in China. Backup use only. Normally the debug mode is only enabled during developing process. If enabled, merger will output some pre-configured notices; they Can easily confirm if a component can work. Comment out or delate directly var debugmode = &quot;xxx&quot; to disable debug mode. merger generates QR Codes needed locally from lrsjng/jquery-qrcode, this can save HTTP requests account and accelerate the loading speed. However, QQ Mobile cannot decode QR Codes in data:image types which are generated as default by lrsjng/jquery-qrcode, so at here we still need to use API to generate QR Code for decoding. The QR Code API is changeable by Modifying var qrcodeapi = &quot;https://www.zhihu.com/qrcode?url=&quot;; part. You can find more QR Code API from the search engine: https://www.google.com/search?q=qr+code+generate+api Please be aware that you don’t have to replace the QR Code API. In addition, please confirm the API you want is operational before you replace to it. Configure Page Title and IconYou can find the following codes from the header of merger.html: 1&lt;title&gt;Merger - Merge your qrcode together. Even quicker.&lt;/title&gt; Modify the content between &lt;title&gt; &lt;/title&gt; will be able to change the page title. Modify the href=&quot;xxx&quot; part in &lt;link rel=&quot;shortcut icon&quot; type=&quot;image/x-icon&quot; href=&quot;https://ae01.alicdn.com/kf/UTB8R57Nn0nJXKJkSaiyq6AhwXXak.jpg&quot;&gt; to change page icon. You may use your configured profile photo. Choose Loading Source for Static Filesmerger provides options to switch between jsDelivr CDN and local for static resources at version 0.14. Although jsDelivr has excellent loading speed throughout the globe without a question, but under some special situations the users might want to load static files from local. Below states how to switch loading source for static files. At Header of merger.html {docsify-ignore}123456&lt;!-- Load style files from local --&gt;&lt;!-- &lt;link rel=\"stylesheet\" href=\"assets/styles/spectre.css/spectre.min.css\"&gt; &lt;link rel=\"stylesheet\" href=\"assets/styles/style.min.css\"&gt; --&gt;&lt;!-- Load style files from jsDelivr - Default --&gt;&lt;link rel=\"stylesheet\" href=\"https://cdn.jsdelivr.net/combine/gh/picturepan2/spectre@0.5.7/dist/spectre.min.css,gh/hifocus/merger@0.14/assets/styles/style.min.css\"/&gt; The defualted setting is use jsDelivr CDN with files combination function enabled. If you wish to load relavent files from local, please comment out or delete this line of code: 1&lt;link rel=\"stylesheet\" href=\"https://cdn.jsdelivr.net/combine/gh/picturepan2/spectre@0.5.7/dist/spectre.min.css,gh/hifocus/merger@0.14/assets/styles/style.min.css\"/&gt; And reverse comment (recover) these two lines of codes: 12&lt;!-- &lt;link rel=\"stylesheet\" href=\"assets/styles/spectre.css/spectre.min.css\"&gt; &lt;link rel=\"stylesheet\" href=\"assets/styles/style.min.css\"&gt; --&gt; The final header after modification is as follows: 123456&lt;!-- Load style files from local --&gt;&lt;link rel=\"stylesheet\" href=\"assets/styles/spectre.css/spectre.min.css\"&gt;&lt;link rel=\"stylesheet\" href=\"assets/styles/style.min.css\"&gt;&lt;!-- Load style files from jsDelivr - Default --&gt;&lt;!-- &lt;link rel=\"stylesheet\" href=\"https://cdn.jsdelivr.net/combine/gh/picturepan2/spectre@0.5.7/dist/spectre.min.css,gh/hifocus/merger@0.14/assets/styles/style.min.css\"/&gt; --&gt; Now, you have completed the configuration of Merger.","link":"/docs/configure.html"},{"title":"Hello. Get to Know Merger.","text":"Please note you can always return here by the links below: https://docs.justhx.com/merger (Auto Langauge Detection) https://merger.justhx.com You’re here! Merger’s official website! You can find useful documentations and regular blog posts here. New to here? Just keep reading. IndroductionThe BackgroundFound it hard to pay a friend, or your bill? In China, mobilised payments can’t be easier. Open the app, scan a qrcode provided by the payee, done. No 16 digits of bank account numbers, no sort code, no text message comfirmations. Behind this is a good amount of mobile merchant service providers (like AliPay, WeChat Pay or the Union Pay). The New IssuePeople might get used to a certain service provider and usually pay with that operator. For those people who run business or simply want to receive donations, they will have to put up multiple qrocdes to make sure themselves always get paid from those who want to pay. This is how it will look like: And if you scan the qrcode with the wrong app, it simply won’t work: How Merger Solve ItHere comes Merger: it is a simple yet powerful HTML based application that can help people merge multiple qrcodes into one link. So that the payer can concentrate on only one qrcode, or one simple link: The button will then direct the user to https://donate.justhx.com, where he gets to choose which from all payment methods available. While multiple optiumisations are done on our side, all you need is configure it within 5 minutes, upload it to your server and wait for your costomers to send money through, in a easier, quicker and better way. Quick Start1234cd /path/to/the/directorywget https://github.com/hifocus/merger/archive/0.20.zipunzip 0.20.zip &amp;&amp; cd merger-0.20 &amp;&amp; mv * ../cd ../ &amp;&amp; mv merger.html index.html More info: Install Configuration1vim index.html More info: Configure Please submit an issue if you meet any problems while using Merger. Remember to describe your questions clearly so others can help you. &gt;&gt;&gt; Proceed to /docs to learn more about installation, configuration and deployments.","link":"/posts/hello-get-to-know-merger.html"}],"tags":[],"categories":[{"name":"docs","slug":"docs","link":"/categories/docs/"},{"name":"posts","slug":"posts","link":"/categories/posts/"}]}